ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad7156_lt/low_touch_task.c
lt_app_cfg_type lt_app_cfg;
/*-------------------- Private Function Declarations ------------------------*/
static void LowTouchAd7156IntCallback(uint8_t value);
static void on_timer_init();
static void off_timer_init();
static void lt_on_timer_start(void);
static void lt_on_timer_stop(void);
static void lt_off_timer_start(void);
static void lt_off_timer_stop(void);
static void out2_pin_detect(uint8_t value);
static void LowTouchResetTimer();
static void init_lt_app_lcfg();
static m2m2_hdr_t *lt_app_lcfg_access(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *lt_app_read_ch2_cap(m2m2_hdr_t *p_pkt);
#ifdef DCB
static m2m2_hdr_t *gen_blk_dcb_command_read_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *gen_blk_dcb_command_write_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *gen_blk_dcb_command_delete_config(m2m2_hdr_t *p_pkt);
#endif
extern void find_low_touch_DCB();


static void lt_task(void *arg);
static void SendStartLowTouchLogReq();
static void SendStopLowTouchLogReq();
/*--------------------- Public Funtion Declarations -------------------------*/
extern void SetCfgCopyAvailableFlag(uint8_t nflag);

extern bool get_long_button_press_status();
extern bool reset_long_button_press_status();
extern bool get_usb_powered_event_status();
extern bool reset_usb_powered_event_status();
/* Variable which holds the status of NAND config file */
extern volatile uint8_t gsCfgFileFoundFlag;

/* Variable which holds the status of LT logging in progress or not */
extern uint8_t gLowTouchRunning;

#ifdef DCB
/* Reuse the gsConfigTmpFile[] RAM buffer used in system_task.c for
 * holding copy of either DCB/NAND config file which has LT
 * start/stop sequence of commands.
 * This buffer is to be reused between holding the copy of LT config file
 * as well as temporary storage for DCB content during READ/WRITE DCB block
 * for ADPD, Gen block DCB
 * Buffer to be shared between tasks( General Blk DCB & ADPD4000 DCB ) */
extern uint8_t gsConfigTmpFile[];
#endif

#ifdef USER0_CONFIG_APP
extern ADI_OSAL_SEM_HANDLE   user0_config_app_evt_sem;
#endif

/* State machine variables for ON/OFF wrist events */
volatile LOW_TOUCH_DETECTION_STATUS_ENUM_t eDetection_State = OFF_WRIST,
                                  eCurDetection_State = OFF_WRIST;

/* Uncomment the below macro & change variables from SES Debug session:
   eCurDetection_State = ON_WRIST , gb_trig_event = 1 -> to generate ON_WR event
   eCurDetection_State = OFF_WRIST, gb_trig_event = 1 -> to generate OFF_WR
   event
*/
//#define TEST_LT_APP_WITHOUT_EVENTS 1

#define LT_APP_ROUTING_TBL_SZ                                                  \
  (sizeof(lt_app_routing_table) / sizeof(lt_app_routing_table[0]))

typedef m2m2_hdr_t *(app_cb_function_t)(m2m2_hdr_t *);

typedef struct _app_routing_table_entry_t {
  uint8_t command;
  app_cb_function_t *cb_handler;
} app_routing_table_entry_t;

/* Routing table structure, to handle m2m2 command REQ from LT task function */
app_routing_table_entry_t lt_app_routing_table[] = {
    {M2M2_APP_COMMON_CMD_READ_LCFG_REQ,  lt_app_lcfg_access},
    {M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ, lt_app_lcfg_access},
    {M2M2_LT_COMMAND_RD_CH2_CAP_REQ, lt_app_read_ch2_cap},
#ifdef DCB
    {M2M2_DCB_COMMAND_READ_CONFIG_REQ, gen_blk_dcb_command_read_config},
    {M2M2_DCB_COMMAND_WRITE_CONFIG_REQ, gen_blk_dcb_command_write_config},
    {M2M2_DCB_COMMAND_ERASE_CONFIG_REQ, gen_blk_dcb_command_delete_config},
#endif
};

static void init_lt_app_lcfg() {

  /* Check & Load from DCB LT lcfg if lcfg is available in lt_app_lcfg_dcb */
  if (lt_app_lcfg_get_dcb_present_flag()) {
      lt_app_lcfg_set_from_dcb();
  }

  /* Loading default or modified fw LT lcfg */
  else
  {
    if( !user_applied_onWristTimeThreshold )
      lt_app_cfg.onWristTimeThreshold  = LT_ON_WRIST_TIME_INTERVAL;
    else
      user_applied_onWristTimeThreshold = 0;

    if( !user_applied_offWristTimeThreshold )
      lt_app_cfg.offWristTimeThreshold = LT_OFF_WRIST_TIME_INTERVAL;
    else
      user_applied_offWristTimeThreshold = 0;

    if( !user_applied_airCapVal )
      lt_app_cfg.airCapVal  = LT_AIR_CAP_VAL;
    else
      user_applied_airCapVal = 0;

    if( !user_applied_skinCapVal )
      lt_app_cfg.skinCapVal = LT_SKIN_CAP_VAL;
    else
      user_applied_skinCapVal = 0;

    if( !user_applied_ltAppTrigMethd )
    {
#ifdef ENABLE_WATCH_DISPLAY
      lt_app_cfg.ltAppTrigMethd  = gn_default_lt_mode;
      //lt_app_cfg.ltAppTrigMethd  = LT_APP_BUTTON_TRIGGER;
#else
    lt_app_cfg.ltAppTrigMethd = LT_APP_CAPSENSE_TUNED_TRIGGER;
#endif//#ifdef ENABLE_WATCH_DISPLAY
    }
    else
      user_applied_ltAppTrigMethd = 0;
  }

  if( lt_app_cfg.ltAppTrigMethd  == LT_APP_CAPSENSE_TUNED_TRIGGER )
  {
    //Sanity check on parameters
    if( lt_app_cfg.airCapVal < lt_app_cfg.skinCapVal        ||
        (lt_app_cfg.airCapVal - lt_app_cfg.skinCapVal) < 10 )
    {
      NRF_LOG_INFO("Unexpected lcfg parameters passed, falling to fw default");
      lt_app_cfg.airCapVal  = LT_AIR_CAP_VAL;
      lt_app_cfg.skinCapVal = LT_SKIN_CAP_VAL;
    }

    gn_ch2_sensitivity = (lt_app_cfg.airCapVal - lt_app_cfg.skinCapVal)/2;
  }
  else
  {
    /* Mainly handled for lt_app_cfg.ltAppTrigMethd  ==
      LT_APP_CAPSENSE_DISPLAY_TRIGGER
    */
    /* Hardcode the sensitivity to used based on general trend seen
       from tuning
    */
    gn_ch2_sensitivity = 20;
  }

  AD7156_SetSensitivity(AD7156_CHANNEL2,gn_ch2_sensitivity);
  //AD7156_SetSensitivity(AD7156_CHANNEL2,25);

}

/*!
 ****************************************************************************
 * @brief    Example of how to write an LCFG parameter
 * @param    LCFG field that has to be written
 * @param    Value to be written
 * @retval   LT_APP_ERROR_CODE_t
 *****************************************************************************/
LT_APP_ERROR_CODE_t lt_app_write_lcfg(uint8_t field, uint16_t value) {
  if (field < LT_APP_LCFG_MAX) {
    switch (field) {
    case LT_APP_LCFG_ONWR_TIME:
      lt_app_cfg.onWristTimeThreshold = value;
      user_applied_onWristTimeThreshold = 1;
      break;
    case LT_APP_LCFG_OFFWR_TIME:
      lt_app_cfg.offWristTimeThreshold = value;
      user_applied_offWristTimeThreshold = 1;
      break;
    case LT_APP_LCFG_AIR_CAP_VAL:
      lt_app_cfg.airCapVal = value;
      user_applied_airCapVal = 1;
      break;
    case LT_APP_LCFG_SKIN_CAP_VAL:
      lt_app_cfg.skinCapVal = value;
      user_applied_skinCapVal = 1;
      break;
    case LT_APP_LCFG_TRIGGER_METHOD:
      lt_app_cfg.ltAppTrigMethd = value;
      user_applied_ltAppTrigMethd = 1;
      /* Handle lcfg write to change the trigger mode and set
         the display page accordingly */
#ifdef CUST4_SM
      if(get_low_touch_trigger_mode3_status())
      {
        dis_page_jump(&page_watch_id);
      }
      else
      {
        dis_page_jump(&page_menu);
      }
#endif
      break;
    }
    return LT_APP_SUCCESS;
  }
  return LT_APP_ERROR;
}

/*!
 ****************************************************************************
 * @brief    Read LCFG parameter
 * @param    LCFG field
 * @param    Returned corresponding LCFG value
 * @retval   LT_APP_ERROR_CODE_t
 *****************************************************************************/
LT_APP_ERROR_CODE_t lt_app_read_lcfg(uint8_t index, uint16_t *value) {
  if (index < LT_APP_LCFG_MAX) {
    switch (index) {
    case LT_APP_LCFG_ONWR_TIME:
      *value = lt_app_cfg.onWristTimeThreshold;
      break;
    case LT_APP_LCFG_OFFWR_TIME:
      *value = lt_app_cfg.offWristTimeThreshold;
      break;
    case LT_APP_LCFG_AIR_CAP_VAL:
      *value = lt_app_cfg.airCapVal;
      break;
    case LT_APP_LCFG_SKIN_CAP_VAL:
      *value = lt_app_cfg.skinCapVal;
      break;
    case LT_APP_LCFG_TRIGGER_METHOD:
      *value = (uint16_t)lt_app_cfg.ltAppTrigMethd;
      break;
    }
    return LT_APP_SUCCESS;
  }
  return LT_APP_ERROR;
}

/*!
 ****************************************************************************
 *@brief      LT app lcfg Read/write configuration options
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t
 *****************************************************************************/
static m2m2_hdr_t *lt_app_lcfg_access(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  PYLD_CST(p_pkt, lt_app_lcfg_op_hdr_t, p_in_payload);
  /* Allocate a response packet with space for the correct number of operations
   */
  PKT_MALLOC(p_resp_pkt, lt_app_lcfg_op_hdr_t,
      p_in_payload->num_ops * sizeof(p_in_payload->ops[0]));
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, lt_app_lcfg_op_hdr_t, p_resp_payload);
    uint16_t reg_data = 0;

