ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad7156_lt/low_touch_task.c
    switch (p_in_payload->command) {
    case M2M2_APP_COMMON_CMD_READ_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        if (lt_app_read_lcfg(p_in_payload->ops[i].field, &reg_data) == LT_APP_SUCCESS) {
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = reg_data;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_READ_LCFG_RESP;
      break;
    case M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        if (lt_app_write_lcfg(p_in_payload->ops[i].field,
                p_in_payload->ops[i].value) == LT_APP_SUCCESS) {
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = p_in_payload->ops[i].value;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_WRITE_LCFG_RESP;
      break;
    default:
      /* Something has gone horribly wrong. */
      return NULL;
    }
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->num_ops = p_in_payload->num_ops;
    p_resp_payload->status = status;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 *@brief      LT app lcfg Read/write configuration options
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t
 ******************************************************************************/
static m2m2_hdr_t *lt_app_read_ch2_cap(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  /* Allocate a response packet with space for the correct number of operations
   */
  PKT_MALLOC(p_resp_pkt, lt_app_rd_ch2_cap, 0);
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, lt_app_rd_ch2_cap, p_resp_payload);
    uint16_t capVal = 0;

    //if(gsLowTouchInitFlag)
    //{
      capVal = AD7156_ReadChannelCap(2); // unit in fF
      status = M2M2_APP_COMMON_STATUS_OK;
    //} else {
    //  status = M2M2_APP_COMMON_STATUS_ERROR;
    //}

    p_resp_payload->command = M2M2_LT_COMMAND_RD_CH2_CAP_RESP;
    p_resp_payload->status = status;
    p_resp_payload->capVal = capVal;
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
  }
  return p_resp_pkt;
}

#ifdef ENABLE_LT_TEST_PAGE

/**
 * @brief Funtion to take LT specific variables, to be shown from LT test page
 *
 * @details This function fills the string input arguments, with LT status
 * variables, to be displayed from LT test page
 *
 * @param str0, str1, str2 - string input arguments, to which LT status gets
 * copied to
 * @retval   None
 */
void lt_disp_str(char *str0, char *str1, char *str2) {
  sprintf(str0, "OnC:%04d OffC:%04d", g_onWrCapValue, g_offWrCapValue);
  sprintf(str1, "Int:%d Val:%d Cap:%04d", gsLowTouchAd7156IntCount,
      gsLowTouchAd7156IntValue, gsLowTouchAd7156CapVal);
  (eCurDetection_State == OFF_WRIST)
      ? sprintf(str2, "OFF_WR %d", gLowTouchRunning)
      : sprintf(str2, "ON_WR %d", gLowTouchRunning);
}
#endif

/** @brief   Low Touch Application Enable/Disable Function
 * @details  Sets/Resets the Low touch enable flag; activates/deactivates
 *           the touch sensor and touch detection mechanism
 *           LT App "Enable" is to be done only once a LT config file is
 *           written to DCB/NAND
 * @param    True --> Sets the flag, does AD7156 init for CH2
 *           False --> Resets the flag, does AD7156 de-init for CH2
 * @retval   0  --> success 1 --> fail(returned when it has been initialised/deinitialised already)
 */
int EnableLowTouchDetection(bool bFlag) {
  uint32_t ret;
  gEnableLowTouchDetection = bFlag;
  if (bFlag) {
    NRF_LOG_INFO("Enabling LT app");
    ret = low_touch_init();
  } else {
    NRF_LOG_INFO("Disabling LT app");
    ret = low_touch_deinit();
  }
  return ret;
}

/** @brief   Low Touch Application Initialization status
 * @details  Check if LT application is enabled or disabled
 * @param    None
 * @retval   0  --> LT app not enabled 1 --> LT app already enabled
 */
int get_lt_app_status() {
  return gsLowTouchInitFlag;
}

/** @brief   Check if LT application trigger method is LT_APP_CAPSENSE_TUNED_TRIGGER
 * @details  This is to be used for a LT config file(NAND/gen blk DCB) write/delete
             such that the trigger happens properly for
             LT_APP_CAPSENSE_TUNED_TRIGGER
 * @param    None
 * @retval   0  --> LT_APP_CAPSENSE_TUNED_TRIGGER not enabled
             1 --> LT_APP_CAPSENSE_TUNED_TRIGGER enabled
 */
bool check_lt_app_capsense_tuned_trigger_status() {
  if( lt_app_cfg.ltAppTrigMethd  == LT_APP_CAPSENSE_TUNED_TRIGGER )
  {
    return true;
  }
  else
  {
    return false;
  }
}

/** @brief   Check if LT application trigger method is LT_APP_BUTTON_TRIGGER
 * @details  This is to be used for a LT config file(NAND/gen blk DCB) write/delete
             such that the trigger happens properly for
             LT_APP_BUTTON_TRIGGER
 * @param    None
 * @retval   0  --> LT_APP_BUTTON_TRIGGER not enabled
             1 --> LT_APP_BUTTON_TRIGGER enabled
 */
bool get_low_touch_trigger_mode2_status(void)
{
  if( lt_app_cfg.ltAppTrigMethd  == LT_APP_BUTTON_TRIGGER )
  {
    return true;
  }
  else
  {
    return false;
  }
}

#ifdef CUST4_SM
/** @brief   Check if LT application trigger method is LT_APP_INTERMITTENT_TRIGGER
 * @details  This is to be used for a LT config file(NAND/gen blk DCB) write/delete
             such that the trigger happens properly for
             LT_APP_INTERMITTENT_TRIGGER
 * @param    None
 * @retval   0  --> LT_APP_INTERMITTENT_TRIGGER not enabled
             1 --> LT_APP_INTERMITTENT_TRIGGER enabled
 */
bool get_low_touch_trigger_mode3_status(void)
{
  if( lt_app_cfg.ltAppTrigMethd  == LT_APP_INTERMITTENT_TRIGGER )
  {
    return true;
  }
  else
  {
    return false;
  }
}
#else
bool get_low_touch_trigger_mode3_status(void)
{
  return false;
}
#endif

/** @brief   Get LT application trigger method
 * @details  This is to be used from the display page: page_low_touch_trigger_mode.c
             to show the current Mode set
 * @param    None
 * @retval   LT_APP_LCFG_TRIGGER_METHOD_t -->
                  LT_APP_CAPSENSE_TUNED_TRIGGER = 0,
                  LT_APP_CAPSENSE_DISPLAY_TRIGGER = 1,
                  LT_APP_BUTTON_TRIGGER = 2,
                  LT_APP_INTERMITTENT_TRIGGER = 3
                  LT_APP_TRIGGER_INVALID = 4,
 */
LT_APP_LCFG_TRIGGER_METHOD_t get_lt_app_trigger_method() {
  return lt_app_cfg.ltAppTrigMethd;
}

