ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad7156_lt/low_touch_task.c
    // We got an m2m2 message from the queue, process it.
    if (p_in_pkt != NULL) {
      // We got an m2m2 message from the queue, process it.
      PYLD_CST(p_in_pkt, _m2m2_app_common_cmd_t, p_in_cmd);
      // Look up the appropriate function to call in the function table
      for (int i = 0; i < LT_APP_ROUTING_TBL_SZ; i++) {
        if (lt_app_routing_table[i].command == p_in_cmd->command) {
          p_out_pkt = lt_app_routing_table[i].cb_handler(p_in_pkt);
          break;
        }
      }
      post_office_consume_msg(p_in_pkt);
      if (p_out_pkt != NULL) {
        post_office_send(p_out_pkt, &err);
      }
    } else {
      if (eCurDetection_State == ON_WRIST && gb_trig_event) {
        OnWristEventDetecedCnt++;
        SendStartLowTouchLogReq(); /*start low touch logging*/
        NRF_LOG_INFO("send start low touch log req");
        gb_trig_event = 0;
      }
      if (eCurDetection_State == OFF_WRIST && gb_trig_event) {
        OffWristEventDetecedCnt++;
        SendStopLowTouchLogReq(); /*stop low touch logging*/
        NRF_LOG_INFO("send stop low touch log req");
        gb_trig_event = 0;
      }
    } // else
  }
#else

  while (1) {
    m2m2_hdr_t *p_in_pkt = NULL;
    m2m2_hdr_t *p_out_pkt = NULL;
    adi_osal_SemPend(lt_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);
    p_in_pkt = post_office_get(ADI_OSAL_TIMEOUT_NONE, APP_OS_CFG_LT_TASK_INDEX); //LT events

    // We got an m2m2 message from the queue, process it.
    if (p_in_pkt != NULL) {
      // We got an m2m2 message from the queue, process it.
      PYLD_CST(p_in_pkt, _m2m2_app_common_cmd_t, p_in_cmd);
      // Look up the appropriate function to call in the function table
      for (int i = 0; i < LT_APP_ROUTING_TBL_SZ; i++) {
        if (lt_app_routing_table[i].command == p_in_cmd->command) {
          p_out_pkt = lt_app_routing_table[i].cb_handler(p_in_pkt);
          break;
        }
      }
      post_office_consume_msg(p_in_pkt);
      if (p_out_pkt != NULL) {
        post_office_send(p_out_pkt, &err);
      }
    }
#ifdef ENABLE_WATCH_DISPLAY
    else if(get_low_touch_trigger_mode2_status())
    {
        if (get_usb_powered_event_status()) {
          reset_usb_powered_event_status();
          SendStopLowTouchLogReq();
          key_detect_init();
        } else if (get_lt_mode2_selection_status()) {
          if (gsCfgFileFoundFlag || gen_blk_get_dcb_present_flag())
          {
            SendStartLowTouchLogReq();  /* start the low touch logging*/
            //adi_osal_ThreadSuspend(NULL);
          }
          else
          {
            reset_lt_mode2_selection_status();
            /*Send Config file not found alarm to the tool*/
            SendSystemAlarmNtfMsg(M2M2_APP_COMMON_ALARM_STATUS_CONFIG_FILE_NOT_FOUND);
            LowTouchErr();
          }
        } else {
            // Nothing //
        }
    }
#ifdef CUST4_SM
    else if(get_low_touch_trigger_mode3_status())
    {
        USER0_CONFIG_APP_STATE_t read_user0_config_app_state = get_user0_config_app_state();
        if ((read_user0_config_app_state == STATE_INTERMITTENT_MONITORING_STOP_LOG) ||
            (read_user0_config_app_state == STATE_OUT_OF_BATTERY_STATE_DURING_INTERMITTENT_MONITORING)) {
          SendStopLowTouchLogReq();
          //key_detect_init();
        } else if (read_user0_config_app_state == STATE_INTERMITTENT_MONITORING) {
          if (gsCfgFileFoundFlag || gen_blk_get_dcb_present_flag())
          {
            SendStartLowTouchLogReq();  /* start the low touch logging*/
            set_user0_config_app_state(STATE_INTERMITTENT_MONITORING_START_LOG);
          }
          else
          {
            LowTouchErr();
          }
        } else {
            // Nothing //
        }
    }
#endif
    else if( lt_app_cfg.ltAppTrigMethd == LT_APP_CAPSENSE_TUNED_TRIGGER ||
       lt_app_cfg.ltAppTrigMethd  == LT_APP_CAPSENSE_DISPLAY_TRIGGER )
#else
    else if( lt_app_cfg.ltAppTrigMethd == LT_APP_CAPSENSE_TUNED_TRIGGER)
#endif //ENABLE_WATCH_DISPLAY
    {
      LowTouchTimerEvent();
      LowTouchSensorEvent();
    }
//    adi_osal_ThreadSuspend(NULL);
  }
#endif //TEST_LT_APP_WITHOUT_EVENTS
}

/**
 * @brief  Function to resume the LT task
 * @param  None
 * @return None
 */
void resume_low_touch_task(void)
{
    vTaskResume((TaskHandle_t)gh_lt_task_handler);
}

#ifdef ENABLE_WATCH_DISPLAY
/**
 * @brief  Function to resume the LT task and key task, if low touch log request failed
 *         Called by MaxFileErr(), LowTouchErr().
 * @param  None
 * @return None
 */
void resume_key_and_lt_task(void)
{
  if(get_low_touch_trigger_mode2_status() && get_lt_mode2_selection_status())
  {
    reset_lt_mode2_selection_status();  /*reset the LT MD2 log selection status*/
    key_detect_init();      /* Since Low touch log failed to start, enable the buttons back*/
    vTaskResume((TaskHandle_t)gh_lt_task_handler);
  }
  else
  {
    key_detect_init();      /* Since Low touch log failed to start, enable the buttons back*/
  }
}
#endif

/**
 * @brief  Function to send PO pkts to LT task
 * @param  p_pkt m2m2 packet to be send to LT task
 * @return None
 */
void send_message_lt_task(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  if(p_pkt != NULL)
  {
    osal_result = adi_osal_MsgQueuePost(gh_lt_task_msg_queue, p_pkt);
    if (osal_result != ADI_OSAL_SUCCESS)
      post_office_consume_msg(p_pkt);
  }
  adi_osal_SemPost(lt_task_evt_sem);
}

/**
 * @brief  Function to set the LT app lcfg to default fw values
 * @param  None
 * @return None
 */
void lt_app_lcfg_set_fw_default()
{
    lt_app_cfg.onWristTimeThreshold  = LT_ON_WRIST_TIME_INTERVAL;
    lt_app_cfg.offWristTimeThreshold = LT_OFF_WRIST_TIME_INTERVAL;
    lt_app_cfg.airCapVal  = LT_AIR_CAP_VAL;
    lt_app_cfg.skinCapVal = LT_SKIN_CAP_VAL;

#ifdef ENABLE_WATCH_DISPLAY
    lt_app_cfg.ltAppTrigMethd = gn_default_lt_mode;
    //lt_app_cfg.ltAppTrigMethd  = LT_APP_BUTTON_TRIGGER;
#else
    lt_app_cfg.ltAppTrigMethd = LT_APP_CAPSENSE_TUNED_TRIGGER;
#endif//ENABLE_WATCH_DISPLAY
}

/**
 * @brief  Function to set the LT app lcfg to from lt_app_lcfg DCB
 * @param  None
 * @return None
 */
void lt_app_lcfg_set_from_dcb()
{
  load_lt_app_lcfg_dcb();
  copy_lt_lcfg_from_lt_app_lcfg_dcb(&lt_app_cfg);
}

