ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad7156_lt/low_touch_task.c
#ifdef DCB
/**
 * @brief  Function which handles the m2m2 command to do gen_blk_DCB read
 * @param  p_pkt m2m2 REQ packet
 * @return m2m2 RESP packet
 */
static m2m2_hdr_t *gen_blk_dcb_command_read_config(m2m2_hdr_t *p_pkt) {
  uint16_t r_size;
  uint16_t i, p, num_of_pkts, dcbdata_index;
  //uint32_t dcbdata[MAXGENBLKDCBSIZE * MAX_GEN_BLK_DCB_PKTS];
  /* dcbdata - storage for DCB content during READ DCB block
   * for Gen block DCB; Reusing the RAM buffer from system task,
   * instead of declaring it in the function,
   * saves space on Stack requirement from LT Task
   */
  uint32_t *dcbdata = (uint32_t *)&gsConfigTmpFile[0];
  ADI_OSAL_STATUS err;

  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

  PKT_MALLOC(p_resp_pkt, m2m2_dcb_gen_blk_data_t, 0);
  if(NULL != p_resp_pkt)
  {
    // Declare a pointer to the response packet payload
    PYLD_CST(p_resp_pkt, m2m2_dcb_gen_blk_data_t, p_resp_payload);

    r_size =
        (uint16_t)(MAXGENBLKDCBSIZE * MAX_GEN_BLK_DCB_PKTS); // Max words that can be read from FDS
    memset(dcbdata, 0, (r_size*sizeof(dcbdata[0])));

    if (read_gen_blk_dcb(&dcbdata[0], &r_size) == GEN_BLK_DCB_STATUS_OK) {
      status = M2M2_DCB_STATUS_OK;
      num_of_pkts = (r_size/MAXGENBLKDCBSIZE) +
                    ( (r_size%MAXGENBLKDCBSIZE) ? 1 : 0 );
      dcbdata_index = 0;
      for( p=0; p<num_of_pkts; p++ )
      {
      	p_resp_payload->size = (p != num_of_pkts-1) ? MAXGENBLKDCBSIZE :
                                                     (r_size%MAXGENBLKDCBSIZE);
      	p_resp_payload->num_of_pkts = num_of_pkts;
      	for (i = 0; i < p_resp_payload->size; i++)
      		p_resp_payload->dcbdata[i] = dcbdata[dcbdata_index++];
      	NRF_LOG_INFO("%d pkt's sz->%d", (p+1), p_resp_payload->size);
      	if(p != num_of_pkts-1)
      	{
          p_resp_pkt->src = p_pkt->dest;
      	  p_resp_pkt->dest = p_pkt->src;
          p_resp_payload->status = status;
          p_resp_payload->command = M2M2_DCB_COMMAND_READ_CONFIG_RESP;
      	  post_office_send(p_resp_pkt, &err);

      	  /*Delay is required b/w two pkts send, this was increased from 20,
      	  kept initially to 60, when back to back write/read/delete DCB
      	  tests were seen to fail
      	  */
      	  MCU_HAL_Delay(60);

      	  PKT_MALLOC(p_resp_pkt, m2m2_dcb_gen_blk_data_t, 0);
      	  if(NULL != p_resp_pkt)
      	  {
      	  	// Declare a pointer to the response packet payload
      	  	PYLD_CST(p_resp_pkt, m2m2_dcb_gen_blk_data_t, p_resp_payload);

      	  }//if(NULL != p_resp_pkt)
      	  else
      	  {
      	  	return NULL;
      	  }
      	}
      }//for loop
    } else {
      p_resp_payload->size = 0;
      p_resp_payload->num_of_pkts = 0;
      status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_READ_CONFIG_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }//if(NULL != p_resp_pkt)
  return p_resp_pkt;
}


/**
 * @brief  Function which handles the m2m2 command to do gen_blk_DCB write
 * @param  p_pkt m2m2 REQ packet
 * @return m2m2 RESP packet
 */
static m2m2_hdr_t *gen_blk_dcb_command_write_config(m2m2_hdr_t *p_pkt) {
  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;
  //uint32_t  dcbdata[MAXGENBLKDCBSIZE*MAX_GEN_BLK_DCB_PKTS];
  /* dcbdata - storage for DCB content during write DCB block
   * for Gen block DCB. Reusing the RAM buffer from system task,
   * instead of declaring a static buffer in the function,
   * saves space on total RAM usage from the watch application
   */
  static uint32_t *dcbdata = (uint32_t *)&gsConfigTmpFile[0];
  static uint16_t i = 0;
  static uint16_t num_of_pkts = 0;
  uint16_t j;

  // Declare a pointer to access the input packet payload
  PYLD_CST(p_pkt, m2m2_dcb_gen_blk_data_t, p_in_payload);
  PKT_MALLOC(p_resp_pkt, m2m2_dcb_gen_blk_data_t, 0);
  if(NULL != p_resp_pkt)
  {
    // Declare a pointer to the response packet payload
    PYLD_CST(p_resp_pkt, m2m2_dcb_gen_blk_data_t, p_resp_payload);

    // Maximum (MAX_GEN_BLK_DCB_PKTS) packets can be written to GEN_BLK_DCB
    if (p_in_payload->num_of_pkts >= 1 && p_in_payload->num_of_pkts <= MAX_GEN_BLK_DCB_PKTS) {
      num_of_pkts += 1;
      for (j = 0; j < p_in_payload->size; j++)
        dcbdata[i++] = p_in_payload->dcbdata[j];
      NRF_LOG_INFO("Wr DCB:pkt sz->%d, arr index=%d", p_in_payload->size, i);
      if (num_of_pkts == p_in_payload->num_of_pkts) {
        if (write_gen_blk_dcb(&dcbdata[0], i) == GEN_BLK_DCB_STATUS_OK) {
          gen_blk_set_dcb_present_flag(true);
          find_low_touch_DCB();//Update gbDCBCfgFoundFlag in system task
          NRF_LOG_INFO("LT gen blk DCB written");
          if( check_lt_app_capsense_tuned_trigger_status() )
          {
            EnableLowTouchDetection(true);
          }
          status = M2M2_DCB_STATUS_OK;
        } else {
          status = M2M2_DCB_STATUS_ERR_ARGS;
        }
        num_of_pkts = 0;
        i = 0;
      } else if (num_of_pkts < p_in_payload->num_of_pkts) {
        status = M2M2_DCB_STATUS_OK;
      } else {
          /* Unexpected, some error condition, clear the static variables kept */
          num_of_pkts = 0;
          i = 0;
          status = M2M2_DCB_STATUS_ERR_ARGS;
      }
    }
    else
    {
      /* Unexpected, some error condition, clear the static variables kept */
      num_of_pkts = 0;
      i = 0;
      status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_WRITE_CONFIG_RESP;
    p_resp_payload->size = 0;
    p_resp_payload->num_of_pkts = p_in_payload->num_of_pkts;
    for(uint16_t k=0; k<MAXGENBLKDCBSIZE; k++)
      p_resp_payload->dcbdata[k] = 0;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }//if(NULL != p_resp_pkt)
  return p_resp_pkt;
}

/**
 * @brief  Function which handles the m2m2 command to do gen_blk_DCB delete
 * @param  p_pkt m2m2 REQ packet
 * @return m2m2 RESP packet
 */
static m2m2_hdr_t *gen_blk_dcb_command_delete_config(m2m2_hdr_t *p_pkt) {
  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

  PKT_MALLOC(p_resp_pkt, m2m2_dcb_gen_blk_data_t, 0);
  if(NULL != p_resp_pkt)
  {
    // Declare a pointer to the response packet payload
    PYLD_CST(p_resp_pkt, m2m2_dcb_gen_blk_data_t, p_resp_payload);

    if (delete_gen_blk_dcb() == GEN_BLK_DCB_STATUS_OK) {
      gen_blk_set_dcb_present_flag(false);
      SetCfgCopyAvailableFlag(false); /*update the config file copy availability
                                         flag upon LT gen blk DCB deletion */
      find_low_touch_DCB();//Update gbDCBCfgFoundFlag in system task
      NRF_LOG_INFO("LT gen blk DCB deleted");

      if( check_lt_app_capsense_tuned_trigger_status() )
      {
        if (!gen_blk_get_dcb_present_flag() && !gsCfgFileFoundFlag)
          EnableLowTouchDetection(false);
      }
      status = M2M2_DCB_STATUS_OK;
    } else {
      status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_ERASE_CONFIG_RESP;
    p_resp_payload->size = 0;
    for(uint16_t i=0; i<MAXGENBLKDCBSIZE; i++)
      p_resp_payload->dcbdata[i] = 0;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }//if(NULL != p_resp_pkt)
  return p_resp_pkt;
}
#endif // DCB
#endif//LOW_TOUCH_FEATURE

/** @brief Function to enable/disable the bottom touch channel detection in
 * AD7156
 * @param  en - 1 -> enable 0 -> disable
 * @return none
 */
void bottom_touch_func_set(uint8_t en) {
  Ad7156_detect_set(AD7156_CHANNEL2, en);
}